Autodesk.Revit.DB.SelectionFilterAction
An enumerated type containing the type of actions that may be taken with a selection filter applied to a point cloud.
Since:
2012

Autodesk.Revit.DB.SelectionFilterAction.Isolate
Only points that pass the filter are visible.

Autodesk.Revit.DB.SelectionFilterAction.Highlight
Points that pass the filter are highlighted.

Autodesk.Revit.DB.SelectionFilterAction.None
Selection filter is ignored.